#2) გამოიტანეთ მომხმარებლის შემოყვანილი სახელი 10-ჯერ იტერაციის მეშვეობით


for i in range(10):
    input("enter num: ")

#3) შექმენით for loop და კომენტარად მიაწერეთ რომელია თავი და რომელი სხეული

#for i in range(1, 6, 1):   #თავი
    #print("hello world")    #სხეული

#5) მომხმარებელს შემოატანინეთ სხვადასხვა სახელები 5-ჯერ იტერაციის მეშვეობით, შექმენით ამ სახელებისთვის ცვლადი რომელშიც ყოველი სახელი დაემატება და ეს სახელები გამოიყოფა მძიმეებით, ანუ თქვენი ცვლადი 5 სახელის შეყვანის შემდეგ უნდა გამოიყურებოდეს ასე: "{სახელი პირველი}, {სახელი მეორე}, ... {სახელი მეხუთე}"


result = ""
for i in range(5):
    name = input("enter name: ")
    result = result + name + ","
print(result)

