





# 1) შექმენი ორი ტაპლი ერთი შეიცავს ციფრებს, მეორე  ფერებს. შემდეგ შექმენი ახალი ტაპლი, რომელიც აერთიანებს ორივეს.

tup1 = (1, 2, 3, 4, 5)

tup2 = ("red", "white", "yellow")


print(tup1 + tup2)




# # 2) შექმენი Tuple  და შეამოწმე ტაპლში არის თუ არა კონკრეტული ელემენტი.

tup = (1, 2, 3, 4, 5)

print(3 in tup)






# 3)შექმენი Tuple რიცხვებით. დაბეჭდე მხოლოდ ლუწი რიცხვები for ციკლის გამოყენებით.


tup_num = (1, 2, 3, 4, 5)

for i in tup_num:
    if i % 2 == 0:
        print(i)




# 4) გააკეთეთ ეს ამოცანა:
# იპოვე ლუწი რიცხვები და მიიღე ქულები!
# წესები:
# მოცემულია რიცხვების Tuple (3, 6, 8, 1, 9, 12, 4).
# ლუწი რიცხვი არის ისეთი, რომელიც 2-ზე უნაშთოდ იყოფა.
# ყოველი ლუწი რიცხვის პოვნაზე მიიღებ 1 ქულას.
# დაბეჭდე ლუწი რიცხვები და ბოლოს აჩვენე, რამდენი ქულა დააგროვე.
# ახსენით დავალება კომენტარებით.



Tuple = (3, 6, 8, 1, 9, 12, 4)

even_counter = 0

for i in Tuple:
    if i % 2 == 0:
        print(i)
        even_counter += 1
print("ქულა" , even_counter)







# 5)შექმენით tuple სადაც შეინახავთ სიტყვებს შემდეგ დაწერე პროგრამა, რომელიც დაითვლის, რამდენჯერ მეორდება რომელიმე სიტყვა ტაპლში.



tup = ("hello", "world", "hello", "car", "yellow")

print(tup.count("hello"))