#1)  მომხმარებელს შემოატანინეთ თავისი გულის ცემა გააკეთეთ პატარა გულის ცემის სისტემა რომელიც ითვლის რა თქმა უნდა გულის ცემას  თუ 180 ზე მეტია ამ შემთხვევაში მაღალია თუ 160-დან 170 მდე არის ამ შემთვევაში არის ნორმალური თუ 160-ზე ნაკლებია ამ შემთხვევაში დაბალია 


heart_beat = int(input("enter ur heartbeat: "))

if heart_beat > 180:
    print("high")
elif heart_beat == 160-170:
    print("normal")
elif heart_beat < 160:
    print("low")



#2)შექმენი პროგრამა, რომელიც მომხმარებლის მიერ შეყვანილი ასაკის მიხედვით დაადგენს, რომელი ასაკობრივი ჯგუფის წევრია ადამიანი.
#თუ ასაკი უარყოფითია — გამოიტანე: "არასწორი ასაკი"
#თუ ასაკი ნაკლებია 13-ზე — გამოიტანე: "ბავშვი"
#თუ ასაკი არის 13-დან 19-ის ჩათვლით — გამოიტანე: "თინეიჯერი"
#თუ ასაკი არის 20-დან 59-ის ჩათვლით — გამოიტანე: "ზრდასრული"
#თუ ასაკი არის 60 ან მეტი — გამოიტანე: "პენსიონერი"




age = int(input("enter ur age: "))

if age < 13:
    print("child")
elif age == 13-19:
    print("teenage")
elif age == 20-59:
    print("adult")
elif age >= 60:
    print("pensioner")
else:
    print("incorrect age")