# 1) კომენტარის სახით ჩამოთვალე ჩაშენებული ფუნქციები და რას შვება თითეული ახსენი

# 2) კომენატრებით ახსენით როგორ იქმენბა def ფუნქცია 

# 3) შექმენით def ფუნქცია სახელად greet - მას უნდა ჰქონდეს 1 არგუმენტი name და  უნდა დაწერე მისალმების ფუნქცია 



# #print - ტერმინალში შეგვიძლია ნებისმიერი რამის გამოტანა რასაც ვისურვებთ
# len - ვიგებთ ლისტის ან სტრინგის სიგრძეს
# str - სტრინგად ქცევა შეგვიძლია არგუმენტის
# int - ინტეჯერად გადაქცევა
# append - vamatebT elements
# pop - ვიღებთ ბოლო ელემენტს
# input - შეგვაქვს ინფორმაცია



#  def function - 1) def   2) function name   3) ()   4) arguments   5) :



# count of arg - 1;    tpe of arg - any;    output - none



def print_greet(name):
    print("hello" + print_greet)