
#) შექმენით უსასრულო while loop
#while True:
    #print("hello")


#2) გამოიტანეთ მომხმარებლის შემოყვანილი სახელი 10-ჯერ იტერაციის მეშვეობით
count = 0
while count < 10:
    print("hello")
    count = count + 1

#3) შექმენით while loop და კომენტარად მიაწერეთ რომელია თავი და რომელი სხეული
#while True:   # Tavi
    #print()   #sxeuli



#4) მომხმარებელს შემოაყვანინეთ რიცხვი, სანამ ეს რიცხვი არ იქნება 100-ზე მეტი მაქამდე თავიდან მოთხოვთ რიცხვის შემოტანა

num = int(input("enter ur num: "))
while num <= 100:
    num2 = int(input("enter num again: "))

if num > 100:
    print("good job")




#55) მომხმარებელს შემოატანინეთ სხვადასხვა სახელები 5-ჯერ იტერაციის მეშვეობით, შექმენით ამ სახელებისთვის ცვლადი რომელშიც ყოველი სახელი დაემატება და ეს სახელები გამოიყოფა მძიმეებით, ანუ თქვენი ცვლადი 5 სახელის შეყვანის შემდეგ უნდა გამოიყურებოდეს ასე: "{სახელი პირველი}, {სახელი მეორე}, ... {სახელი მეხუთე}"

count = 0
all_names = ""
while count < 5:
    all_names= all_names + input("enter ur name; ") + ","
    count+=1
print(all_names)


