#1)
#--ახსენი რისთვის გამოიყენება ინდექსინი, 
#--დაწერე ინდექსინგის  მაგალიათი ანუ შექმენი დიდი სია და გამოიყენე ინდექსინგი და დაპრინე მე 0-ინდექსი 1-ინდექსი 2-ინდექსი 3-ინდექსი 4-ინდექსი და ასევე 5 ჯერ შეუცვალე მნიშვნელობა სიაში არებულ ელემენტებს ინდექსინგის მეშვეობით

#ინდექსინგის მეშვეობით შეგვიძლიაა ლისთიდან გამოვიტანოთ სასურველი ელემენტი. 

F1_teams = ["Ferrari", "McLaren", "redbull", "mercedes", "aston martin"]

F1_teams[1] = "kick sauber"
F1_teams[4] = "racing bulls"
F1_teams[2] = "williams"
F1_teams[3] = "alpine"
F1_teams[0] = "Haas"




