#  1)ოცემულია სეტი A = {1, 2, 3, 4, 5}.
# დაწერე ამ სეტის ელემენტების რაოდენობა.
# ჩაწერე, არის თუ არა 3 სეტის ელემენტი.
# დაამატე რიცხვი 6 ამ სეტში.
# ამოიღე რიცხვი 2 სეტიდან.

# 2)მოცემულია ორი სეტი: A = {1, 2, 3} და B = {3, 4, 5}.
# იპოვე ამ სეტების გაერთიანება.
# იპოვე ამ სეტების გადაკვეთა.
# იპოვე სეტ A-დან ის ელემენტები, რომლებიც არ ეკუთვნის სეტ B-ს.

# 3)მოცემულია სეტები A = {a, b, c} და B = {b, c, d}. იპოვე A და B-ის სიმეტრიული სხვაობა.

# 4)შექმენი სეტი
# გამოიყენე შესაბამისი მეთოდი ისე, რომ სეტი გახდეს ცარიელი.
# ამოიბეჭდოს მიღებული სეტი.


# 5)შექმენით სეტი და შეინახეთ ელემენტები სასურველი რაოდენობით, შემდეგ კი შექმენით მეორე და საბოლოდ მობეჭდეთ სხვაობა ამ სეტებს შორის. 


A = {1, 2, 3, 4, 5}
print(len(A))
print(3 in A)
A.add(6)
A.remove(2)



A = {1, 2, 3} 
B = {3, 4, 5}
print(A|B)
print(A&B)
print( A - B)



A = {"a", "b", "c"} 
B = {"b", "c", "d"}
print(A ^ B)



set = {1, 2, 3, 4, 5}

print(set.clear())



A = {1, 2, 3} 
B = {3, 4, 5}

print( A - B)