# 1) შექმენით ფუნქცია, რომელსაც გადაეცემა სიმბოლოების სია. ფუნქციამ უნდა დააბრუნოს ეს სია პირველი და ბოლო ელემენტების გარეშე, გამოიყენეთ slicing-ი

# 2) შექმენით ფუნქცია, რომელსაც გადაეცემა ორი რიცხვების სია, გადაურეთ ორივეს for ციკლით და გაიგეთ თითოეულ სიაში რიცხვების ჯამი(შეინახეთ ცალკე ცვლადებში), გაამრავლეთ ორივე ერთმანეთზე და დააბრუნეთ

# 3) შექმენით ფუნქცია, რომელსაც გადაეცემა რიცხვების სია. გადაუარეთ ამ სიას while ციკლით და ჩაამატეთ გაორმაგებული რიცხვები ახალ სიაში. საბოლოოდ დააბრუნეთ ეს სია

# 4) შექმენით ფუნქცია, რომელსაც გადაეცემა რიცხვების სია. გადაუარეთ ამ სიას for ციკლით და ჩაამატეთ მხოლოდ ლუწი რიცხვები ახალ სიაში. საბოლოოდ დააბრუნეთ ეს სია

# 5) შექმენით ფუნქცია, რომელსაც გადაეცემა სახელების სია. შექმენით ახალის სია, სადაც ჩაამატებთ გადმოცემული სიიდან მხოლოდ იმ სახელებს, რომლებიც იწყება "N"-ზე`. საბოლოოდ დააბრუნეთ ეს სია



def chars(name):
    return name[1:-1]


print(chars(["a", "b", "c", "d"]))




def sum(list1, list2):
    sum1 = 0
    sum2 = 0
    for i in list1:
        sum1 = sum1 + i
    for i in list2:
        sum2 = sum2 + i
    return sum1 * sum2


print(sum([1,2,3,4], [5,6,7,8]))



def double(numbers):
    list1 = [] 
    i = 0
    while i < len(numbers):
        list1.append(numbers[i] * 2)
        i += 1
    return list1




print(double([1,2,3,4,5]))




# 4) შექმენით ფუნქცია, რომელსაც გადაეცემა რიცხვების სია. გადაუარეთ ამ სიას for ციკლით და ჩაამატეთ მხოლოდ ლუწი რიცხვები ახალ სიაში. საბოლოოდ დააბრუნეთ ეს სია




def even(numbers):
    list1 = []
    for i in numbers:
        if i % 2 == 0:
            list1.append(i)
    return list1



print(even([1,2,3,4,5,6]))




# 5) შექმენით ფუნქცია, რომელსაც გადაეცემა სახელების სია. შექმენით ახალის სია, სადაც ჩაამატებთ გადმოცემული სიიდან მხოლოდ იმ სახელებს, რომლებიც იწყება "N"-ზე`. საბოლოოდ დააბრუნეთ ეს სია


def nnames(names):
    list1 = []
    for i in names:
        if i[0] == "n":
            list1.append(i)
    return list1






print(nnames(["nika", "gio", "nata", "lasha", "nia"]))


