#1) კომენტარებით ახსენით რისთვის გამოიყენება Len()-ფუნქცია

#len ფუნქცია გამოიყენება ლისთის და სტრინგის სიგრძის გასაგებად





#2)კომენტარებით ახსენით რისთვის გამოიყენება List-ი

#list გამოიყენება მისი თითოეული ელემენტის თანმიმდევრობით ჩასასმელად გვერდიგვერდ



#3)კომენტარებით ახსენით რა განსხვავებაა List-სა და ცვლადებ-ს შორის

#ცვლადებში ვინახავთ რაიმე ინფორმაციას, ლისთებში ვსვამთ სხვადასხვა ელემენტს, სადაც ვსვამთ სხვადასხვა ცვლადებს


#4)რისი შენახვა შეუძლია list-ს?
#ლისთს შეუძლია str, int, float, boolის შენახვა.



#5)შექმენი ლისტი, შეინახეთ სამი წიგნის სახელი. დაბეჭდე მთელი სია და დაბეჭდე, რამდენი წიგნია მასში.
list = ["wigni 1", "wigni 2", "wigni 3"]
print(list)
print([len(list) - 1])