#1) რაში გვეხმარება Indexing-ი?
#შესანიშნავია! აი **სამი უფრო მარტივი დავალება**, რაც ინდექსების გამოყენებას ეხება და შესაფერისია დამწყებთათვის:

#indexing - გვეხმარება  მოცემული ლისთიდან გამოვიტანოთ სასურველი ელემენტი.



#2)
#შეიყვანე ტექსტი და დაბეჭდე მისი პირველი სიმბოლო.

#მაგ: "hello" → `h`

txt = "soso"

print(txt[0])




#3)
#მოცემულია სია: `['cat', 'dog', 'fish']`
#დაბეჭდე მეორე ელემენტი (ინდექსინგით).

#ელემენტი უნდა იყოს `"dog"`


list = ['cat', 'dog', 'fish']

print(list[1])



#4)
#შეიყვანე ტექსტი და დაბეჭდე ბოლო სიმბოლო ინდექსის მეშვეობით (არა სლაისინგით და არა უარყოფითი ინდექსით).
#მაგ: "hello" → `o` (მოძებნე `len(text) - 1` ინდექსით)

txt = "hello world"

print(txt[10])
print([len(txt) - 1])




