#1) შემოატანინეთ მომხხმარებელს სტრინგი და გამოიტანეთ მისი პირველი ასო

print("antena"[3])


#2) შემოატანინეთ მომხმარებელს ორი სტრინგი და გამოიტანეთ მათ გაერთიანება 

name = input("ur name:")
surname = input("ur surname:")

print(name  +  surname)

#3) შემოატანინეთ მომხმარებელს სტრინგი და თუ მომხმარებლის შემოტანილი სტრინგი არის 'yes', მაშინ შემოატანინეთ სახელი და გამოიტანეთ ის. ყველა ვარიანტში საბოლლოდ დაემშვიდობეთ მომხმარებლლს მესიჯი 'goodbye' - თი

if True:
    input("enter ur name:")

print("goodbye")


#4) შემოატანინეთ მომხმარებელს ასო თუ ეს ასო არის 'A' მაშინ გამოიტანეთ რიცხვი 100, თუ ის არის 'B' - 80, თუ 'C' - 60, თუ 'D' - 40, ხოლო თუ 'F' მაშინ სიტყვა 'Failed!'
if True:
    A = input(100)
    B = input(80)
    C = input(60)
    D = input(40)
    F = input("Failed")
#5) მომხმარებელს შემოატანინეთ ორი სტრინგი და თუ ეს სტრინგები ერთმანეთს ემთხვევა გამოიტანეთ True ხოლო თუ არ ემთხვევა გამოიტანეთ False

if True:
    input("enter ur name")
    input("enter ur name")

    



