#name = ['soso', 'gio', "dato", "luka"]
#name[3] = "andria"

#1)  შექმენით List, List-ში შეინახეთ 4 მანქანა და შემდეგ მე-1 და მე-2 ინდექსი შეცვალეთ, საბოლოოდ დაპრიტეთ მთლიანი List-ი
cars = ["Ferrari", "aston martin", "pagani", "McLaren"]

cars[1] = "bentley"
cars[2] = "rolls royce"

print(cars)


#2) რაში გვეხმარება ინდექსინგი? რა შეგივიძლია გავაკეთოთ ინდექსინგის მეშვეობით? შეგვიძლია თუ არა სტრინგების შეცვლა ინდექსინგით?
#ინდექსინგით ლისთიდან შეგვიძლია გამოვიტანოთ ელემენტი რომელსაც მოვითხოვთ. ინდექსინგით შეგვიძლია შევცვალოთ ლისთში მოცემული ნებისმიერი ელემენტი. სტრინდეგბის შეცვლა ინდექსინგით შეუძლებელია



#3) txt = "hello world, python html" 
#--დაბეჭდეთ სტრინგის პირველი ასო,
#--დაბეჭდეთ სტრინგის ბოლო ასო ნეგატიური ინდექსის გამოყენებით,
#--ახსენი როგორ მუშაობს ინდექსები ანუ საიდან იწყება ასევე ნეგატიური ინდექსი საიდან იწყება 
txt = "hello world, python html"
print(txt[0])
print(txt[-1])
#ინდექსინგი იწყება 0 დან. ნეგატიური ინდექსის შემთხვევაში ბოლოდან. თვლა იწყება -1 დან